app/Controllers/Admin/BlogPostController.php

    public function index()
    {
        $data['posts'] = $this->blogPostModel->findAll();
---
SELECT *
FROM `blog_posts`

    public function store()
    {
        $rules = [
            'title' => 'required|min_length[3]|max_length[255]',
            'content' => 'required|min_length[10]',
            'author' => 'required|min_length[3]|max_length[100]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $data = [
            'title' => $this->request->getPost('title'),
            'content' => $this->request->getPost('content'),
            'author' => $this->request->getPost('author')
        ];

        $this->blogPostModel->insert($data);
---
INSERT INTO `blog_posts` (`title`, `content`, `author`, `created_at`, `updated_at`) VALUES ('hii', 'hlodfjvuvv fffft', '123', '2025-12-08 17:42:14', '2025-12-08 17:42:14')

    public function edit($id)
    {
        $data['post'] = $this->blogPostModel->find($id);
---
SELECT *
FROM `blog_posts`
WHERE `blog_posts`.`id` = '2'

    public function delete($id)
    {
        $post = $this->blogPostModel->find($id);
        if (!$post) {
            return redirect()->to('/admin/blog-posts')->with('error', 'Blog post not found');
        }

        $this->blogPostModel->delete($id);
---
SELECT *
FROM `blog_posts`
WHERE `blog_posts`.`id` = '3'
DELETE FROM `blog_posts`
WHERE `id` IN ('3')