app/Controllers/HomeController.php

SELECT *
FROM `blog_posts`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $data['posts'] = $this->blogPostModel->orderBy('created_at', 'DESC')->findAll();

SELECT *
FROM `blog_posts`
WHERE `blog_posts`.`id` = '2'
SELECT *
FROM `comments`
WHERE `post_id` = '2'
ORDER BY `created_at` DESC
---
    public function show($id)
    {
        $data['post'] = $this->blogPostModel->find($id);

        if (!$data['post']) {
            return redirect()->to('/')->with('error', 'Blog post not found');
        }

        // Get comments for this post
        $data['comments'] = $this->commentModel->where('post_id', $id)
                                              ->orderBy('created_at', 'DESC')
                                              ->findAll();

INSERT INTO `comments` (`post_id`, `name`, `email`, `comment`, `created_at`, `updated_at`) VALUES ('2', 'Abhijeet Kumar', 'abhijeetkumar3245@gmail.com', 'nice blog', '2025-12-08 17:49:48', '2025-12-08 17:49:48')
---
    public function addComment()
    {
        $rules = [
            'post_id' => 'required|numeric',
            'name' => 'required|min_length[3]|max_length[100]',
            'email' => 'required|valid_email|max_length[100]',
            'comment' => 'required|min_length[3]|max_length[1000]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $data = [
            'post_id' => $this->request->getPost('post_id'),
            'name' => $this->request->getPost('name'),
            'email' => $this->request->getPost('email'),
            'comment' => $this->request->getPost('comment')
        ];

        $this->commentModel->insert($data);